import { Service } from "../model";

export const getServicesApi = async (): Promise<Service[]> => {
  return [
    {
      id: 1,
      name: "Монтаж",
      parts: [
        {
          id: 1,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 2,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 3,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 4,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 5,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
      ],
    },
    {
      id: 2,
      name: "Монтаж",
      parts: [
        {
          id: 1,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 2,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 3,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 4,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 5,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
      ],
    },
    {
      id: 3,
      name: "Монтаж",
      parts: [
        {
          id: 1,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 2,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 3,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 4,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 5,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
      ],
    },
    {
      id: 4,
      name: "Монтаж",
      parts: [
        {
          id: 1,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 2,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 3,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 4,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 5,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
      ],
    },
    {
      id: 5,
      name: "Монтаж",
      parts: [
        {
          id: 1,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 2,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 3,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 4,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
        {
          id: 5,
          name: "Стандартный монтаж кондиционера до 3,0 кВт (до 30 м2)",
          price: 13000,
        },
      ],
    },
  ];
};
